<template>
    <div class="agreement-text">
        <b> 一、服务条款</b><br>
        <p> 桂林声度数据科技有限公司超声波发行（以下简称“超声波发行”）提供的服务将完全按照其发布的使用协议、服务条款和操作规则严格执行。为获得超声波发行服务，服务使用人（以下称“会员”）应当同意本协议的全部条款并按照页面上的提示完成全部的注册程序。</p>
        <b>二、目的</b><br>
        <p>本协议是以规定用户使用超声波发行提供的服务时，超声波发行与会员间的权利、义务、服务条款等基本事宜为目的。</p>
        <b>三、遵守法律及法律效力</b><br>
        <p>本服务使用协议在向会员公告后，开始提供服务或以其他方式向会员提供服务同时产生法律效力。<br>
        会员同意遵守《中华人民共和国保密法》、《计算机信息系统国际联网保密管理规定》、《中华人民共和国计算机信息系统安全保护条例》、《计算机信息网络国际联网安全保护管理办法》、《中华人民共和国计算机信息网络国际联网管理暂行规定》及其实施办法等相关法律法规的任何及所有的规定，并对会员以任何方式使用服务的任何行为及其结果承担全部责任。<br>
        在任何情况下，如果本网站合理地认为会员的任何行为，包括但不限于会员的任何言论和其他行为违反或可能违反上述法律和法规的任何规定，本网站可在任何时候不经任何事先通知终止向会员提供服务。<br>
        本网站可能不时的修改本协议的有关条款，一旦条款内容发生变动，本网站将会在相关的页面提示修改内容。在更改此使用服务协议时，本网站将说明更改内容的执行日期，变更理由等。且应同现行的使用服务协议一起，在更改内容发生效力前7日内及发生效力前日向会员公告。<br>
        会员需仔细阅读使用服务协议更改内容，会员由于不知变更内容所带来的伤害，本网站一概不予负责。<br>
        如果不同意本网站对服务条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受服务条款的变动。</P>
        <b>四、服务内容</b><br>
        <p>超声波发行服务的具体内容由本网站根据实际情况提供，本网站保留随时变更、中断或终止部分或全部超声波发行服务的权利。</p>
        <b>五、会员的义务</b><br>
        <p>用户在申请使用本网站超声波发行服务时，必须向本网站提供准确的个人资料，如个人资料有任何变动，必须及时更新。
        用户注册成功后，本网站将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
        <br>用户在使用本网站网络服务过程中，必须遵循以下原则：</p>
        <li>遵守中国有关的法律和法规；</li>
        <li>不得为任何非法目的而使用网络服务系统；</li>
        <li>遵守所有与网络服务有关的网络协议、规定和程序；</li>
        <li>不得利用超声波发行服务系统传输任何危害社会，侵蚀道德风尚，宣传不法宗教组织等内容；</li>
        <li>不得利用超声波发行服务系统进行任何可能对互联网的正常运转造成不利影响的行为；</li>
        <li>不得利用超声波发行服务系统上载、张贴或传送任何非法、有害、胁迫、滥用、骚扰、侵害、中伤、粗俗、猥亵、诽谤、侵害他人隐私、辱骂性的、恐吓性的、庸俗淫秽的及有害或种族歧视的或道德上令人不快的包括其他任何非法的信息资料；</li>
        <li>不得利用超声波发行服务系统进行任何不利于本网站的行为；</li>
        <li>如发现任何非法使用用户帐号或帐号出现安全漏洞的情况，应立即通告本网站。</li>
        <b><p>六、本网站的权利及义务</p></b>
        <p>本网站除特殊情况外（例如：协助公安等相关部门调查破案等），致力于努力保护会员的个人资料不被外漏，且不得在未经本人的同意下向第三者提供会员的个人资料。
        <br>本网站根据提供服务的过程，经营上的变化，无需向会员得到同意即可更改，变更所提供服务的内容。
        <br>本网站在提供服务过程中，应及时解决会员提出的不满事宜，如在解决过程中确有难处，可以采取公开通知方式或向会员发送电子邮件寻求解决办法。
        <br>本网站在下列情况下可以不通过向会员通知，直接删除其上载的内容：</p>
        <li>有损于本网站，会员或第三者名誉的内容；</li>
        <li>利用超声波发行服务系统上载、张贴或传送任何非法、有害、胁迫、滥用、骚扰、侵害、中伤、粗俗、猥亵、诽谤、侵害他人隐私、辱骂性的、恐吓性的、庸俗淫秽的及有害或种族歧视的或道德上令人不快的包括其他任何非法的内容；</li>
        <li>侵害本网站或第三者的版权，著作权等内容；</li>
        <li>存在与本网站提供的服务无关的内容；</li>
        <li>无故盗用他人的ID(固有用户名)，姓名上载、张贴或传送任何内容及恶意更改，伪造他人上载内容。</li>
        <b><p>七、知识产权声明</p></b>
        <br>本网站（https://www.sounddat.heard-gl.com/）所有的产品、技术、程序、页面（包括但不限于页面设计及内容）以及资料内容（包括但不限于本站所刊载的图片、视频、Flash等）均属于知识产权，仅供本用户交流、学习、研究和欣赏，未经授权，任何人不得擅自使用，否则，将依法追究法律责任。
        <br>本网站用户在攻略及论坛频道上传的资料内容（包括但不限于图片、视频、Flash、点评等），应保证为原创或已得到充分授权，并具有准确性、真实性、正当性、合法性，且不含任何侵犯第三人权益的内容，因抄袭、转载、侵权等行为所产生的纠纷由用户自行解决，本网站不承担任何法律责任。
        <b><p>八、免责声明</p></b> 
        <br> 任何人因使用本网站而可能遭致的意外及其造成的损失（包括因下载本网站可能链接的第三方网站内容而感染电脑病毒），我们对此概不负责，亦不承担任何法律责任。
        <br>本网站禁止制作、复制、发布、传播等具有反动、色情、暴力、淫秽等内容的信息，一经发现，立即删除。若您因此触犯法律，我们对此不承担任何法律责任。
        <br>本网站会员自行上传或通过网络收集的资源，我们仅提供一个展示、交流的平台，不对其内容的准确性、真实性、正当性、合法性负责，也不承担任何法律责任。
        <br>任何单位或个人认为通过本网站网页内容可能涉嫌侵犯其著作权，应该及时向我们提出书面权利通知，并提供身份证明、权属证明及详细侵权情况证明。我们收到上述法律文件后，将会依法尽快处理。
        <b><p>九、服务变更、中断或终止</p></b> 
        如因系统维护或升级的需要而需暂停超声波发行服务，本网站将尽可能事先进行通告。
        <br>如发生下列任何一种情形，本网站有权随时中断或终止向用户提供本协议项下的超声波发行服务而无需通知用户：
        <li>用户提供的个人资料不真实；</li>
        <li>用户违反本协议中规定的使用规则。</li>
        除前款所述情形外，本网站同时保留在不事先通知用户的情况下随时中断或终止部分或全部超声波发行服务的权利，对于所有服务的中断或终止而造成的任何损失，本网站无需对用户或任何第三方承担任何责任。
        <b><p>十、违约赔偿</p></b> 
        用户同意保障和维护本网站及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给本网站或任何其他第三者造成损失，用户同意承担由此造成的损害赔偿责任。
        <b><p>十一、修改协议</p></b> 
        本网站将可能不时的修改本协议的有关条款，一旦条款内容发生变动，本网站将会在相关的页面提示修改内容。
        <br> 如果不同意本网站对服务条款所做的修改，用户有权停止使用超声波发行服务。如果用户继续使用超声波发行服务，则视为用户接受服务条款的变动。
        <b><p>十二、法律管辖</p></b> 
        本协议的订立、执行和解释及争议的解决均应适用中国法律。
        <br> 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向本网站所在地的人民法院提起诉讼。
        <b><p>十三、其他规定</p></b> 
        本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。
        <br> 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
        <br> <router-link to="/register">我已阅读协议，继续注册</router-link>
    </div>
</template>
<script>
export default {
    
}
</script>
<style>
.agreement-text a {
    color: #07c160;
    text-decoration: none;
    margin: 0 38%;
}
.agreement-text a:hover{
    color: #07c160;
    text-decoration: underline;
}
.agreement-text{
    padding: 40px 20px;
    overflow-y:scroll;
    overflow-x:hidden;
    position: relative;
    top: 100px;
    width:706px;
    height: 720px;
    /* left: 27%; */
    -webkit-border-radius:2px;
    border-radius: 2px;
    box-shadow: 0 0 20px #eaeaea;
    /* padding-bottom: 61px; */
    background: #ffffff;
    border:1px solid #eaeaea;
    background-clip:padding-box; 
    /* margin-bottom: 10%; */
    margin: auto;
}
</style>
